[
  {
    "slug": "lyst",
    "title": "Lyst",
    "date": "2014—2016",
    "byline": "One of the worlds largest fashion aggregators",
    "roles": [
      "Product",
      "Interface",
      "Engineering",
      "Marketing"
    ],
    "intro": "Lyst is one of the biggest online fashion aggregators with over 11,000 designers & retailers and an inventory of millions.",
    "cover": {
      "src": "/images/73869bf6.png",
      "width": 2256,
      "height": 1268,
      "ratio": 0.5620567375886525
    },
    "link": {
      "url": "https://lyst.com",
      "text": "lyst.com"
    },
    "content": [
      [
        "h2",
        "The web product"
      ],
      [
        "p",
        "I joined as a designer in the web team where we worked towards increasing conversion and improving the discoverability of the huge inventory. I worked on a wide range of projects on the website including a new header and navigation, new product pages, editorial content, and a homepage redesign."
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Header Desktop",
          "src": "/images/cc269208.png",
          "width": 2256,
          "height": 1676,
          "ratio": 0.7429078014184397
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Header Mobile",
          "src": "/images/39749fb3.png",
          "width": 2256,
          "height": 1876,
          "ratio": 0.8315602836879432
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Product pages",
          "src": "/images/6c93c9a7.png",
          "width": 2256,
          "height": 2348,
          "ratio": 1.0407801418439717
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Refined product pages",
          "src": "/images/2249fdbe.png",
          "width": 2256,
          "height": 2912,
          "ratio": 1.2907801418439717
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Sales Hub",
          "src": "/images/8642e70e.png",
          "width": 2256,
          "height": 2712,
          "ratio": 1.202127659574468
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Editorial content",
          "src": "/images/483deb66.png",
          "width": 2256,
          "height": 2800,
          "ratio": 1.2411347517730495
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Lysts",
          "src": "/images/40a16ab6.png",
          "width": 2256,
          "height": 2336,
          "ratio": 1.0354609929078014
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Type Pages",
          "src": "/images/d4bab7a9.png",
          "width": 2256,
          "height": 1360,
          "ratio": 0.6028368794326241
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Category navigation",
          "src": "/images/2120f7ed.png",
          "width": 2256,
          "height": 1496,
          "ratio": 0.6631205673758865
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Homepage",
          "src": "/images/d9ad07fa.png",
          "width": 2256,
          "height": 3008,
          "ratio": 1.3333333333333333
        }
      ],
      [
        "h2",
        "Internal tools"
      ],
      [
        "p",
        "I was also part of a small team tasked with building a product to promote certain content to various places on the site. Users selected certain types of content like products or articles, and then they chose where to promote it based on some conditions and exclusions. The website could then request promoted content wherever it needed it. The service would send a list of promotions, making sure to cycle content so the same promotion wasn't seen over and over."
      ],
      [
        "p",
        "As this product got a little more complex, we decided that it would be a good idea if eventually the dashboard would house all our other internal dashboards and tools. We called it Lyst OS. As it happened, shortly after that decision, a new product was in the pipeline which would allow internal teams to manage promotions and discounts for certain retailers. It made sense to build it directly into Lyst OS. I worked almost exclusively on this new dashboard (both design and front-end) while the rest of the team continued work on the promoted content dashboard and the supporting backend."
      ],
      [
        "p",
        "The best decision we made was to create some basic components early on—things like form elements, typography, and layout. This was my first introduction to \"design systems\". I learnt a whole lot more about building truly reusable components and systems than I would just hacking on side projects."
      ],
      [
        "p",
        "As far as I know, Lyst OS is still being worked on with new dashboards being added. Because of the solid foundations, it has apparently been very resilient and ‘stood the test of time’."
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Lyst OS Promotions dashboard",
          "src": "/images/2424fb95.png",
          "width": 2256,
          "height": 1888,
          "ratio": 0.8368794326241135
        }
      ],
      [
        "img",
        null,
        {
          "caption": "Lyst OS Promotions dashboard & a whole host of form components",
          "alt": "Lyst OS form components",
          "src": "/images/b2c4a271.png",
          "width": 2256,
          "height": 2268,
          "ratio": 1.0053191489361701
        }
      ],
      [
        "p",
        "Wheneve I had some downtime, I tried to build small tools that would help other teams in some way. One of those small tools was for the editorial team (or anyone in the company) to crop and resize images for certain presets like article images or social posts. This was accompanied by a chrome extension to preview their cropped images on the Lyst website."
      ],
      [
        "img",
        null,
        {
          "caption": "Drop Crop & Pop",
          "alt": "Drop Crop Pop",
          "src": "/images/d10db65e.png",
          "width": 2256,
          "height": 2776,
          "ratio": 1.2304964539007093
        }
      ],
      [
        "h2",
        "Marketing"
      ],
      [
        "p",
        "The design team also shared responsibility of working on marketing campaigns and social content. This meant I worked on some print collateral and even some poster campaigns that were used in Old Street tube station take overs, and fly posting in New York."
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Old Street Takeover",
          "src": "/images/982a3ae2.png",
          "width": 2256,
          "height": 1716,
          "ratio": 0.7606382978723404
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "NYC Takeover",
          "src": "/images/43d9ccf9.png",
          "width": 2256,
          "height": 1532,
          "ratio": 0.6790780141843972
        }
      ]
    ]
  },
  {
    "slug": "rizon",
    "title": "Rizon",
    "date": "2014—Present",
    "byline": "A golden hour calculator for iPhone",
    "roles": [
      "Product",
      "Interface",
      "Branding",
      "Marketing"
    ],
    "intro": "Figuring out when to take photos outdoors can be a real nightmare. Rizon is an app that alerts you when Golden Hour is approaching so you never miss out on that perfect light.",
    "cover": {
      "src": "/images/902280db.jpg",
      "width": 2256,
      "height": 1268,
      "ratio": 0.5620567375886525
    },
    "link": {
      "url": "https://rizonapp.co",
      "text": "rizonapp.co"
    },
    "content": [
      [
        "h2",
        "The idea"
      ],
      [
        "p",
        "I had the idea for Rizon while browsing a small book store in New York. I saw a calendar with beautiful illustrations of sun and moon phases when I remembered how frustrating it was to find the best time to take photos outdoors. There were a plethora online tools, but they were clunky and lacked focus. I wanted to change that. Taking inspiration from the calendar I'd seen in New York, I did some sketches/planning on the flight home and started putting it into pixels."
      ],
      [
        "img",
        null,
        {
          "caption": "Ideas & inspiration",
          "alt": "Ideas & inspiration",
          "src": "/images/cb14ab1b.png",
          "width": 2256,
          "height": 1440,
          "ratio": 0.6382978723404256
        }
      ],
      [
        "img",
        null,
        {
          "caption": "First pass of screens after sketches",
          "alt": "First Designs",
          "src": "/images/347b8b22.png",
          "width": 2256,
          "height": 1436,
          "ratio": 0.6365248226950354
        }
      ],
      [
        "p",
        "Looking at the first set of mockups, it was clear there wasn't anything that users couldn't get by going to an existing tool. There was more focus but it still wasn't as useful as it could be. I loved the idea of getting notified when the sun was almost in the perfect spot, and thought that would be really useful as a photographer. I built a web prototype but soon ran into the probletm that if I wanted alarm style notifications, I would have to go native."
      ],
      [
        "p",
        "I also knew I had to simplify the interface, so I made the main circle interactive which allowed me to clean up the list of times. By rotating the circle, you could access the information for that moment."
      ],
      [
        "img",
        null,
        {
          "caption": "Some screens from the web prototype",
          "alt": "Web Prototype",
          "src": "/images/5ebb1332.png",
          "width": 2256,
          "height": 1362,
          "ratio": 0.6037234042553191
        }
      ],
      [
        "h2",
        "Iterations"
      ],
      [
        "p",
        "I had a stab at making this version as a native iOS app. Despite trying a few courses, Objective C was still too alien to the time. If I wanted Rizon to be as feature-rich as it needed to be, I needed some help. I found a developer who was willing to work on Rizon in exchange for some future design work on one of his ideas."
      ],
      [
        "p",
        [
          [
            "a",
            "Malolan",
            {
              "title": null,
              "href": "https://twitter.com/malolan_s"
            }
          ],
          " was in Boston, and I was in London so the time difference was difficult at first. We made it work by using Slack. I could make improvements to the designs in the evening, and then Malolan could build them over night. Using Slack meant he could leave any questions, and I could answer when I woke up in the morning. To keep conversations focused, we had specific channels for things like animations, notifications, and user feedback."
        ]
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Design improvements",
          "src": "/images/e5a5a496.png",
          "width": 2256,
          "height": 1420,
          "ratio": 0.6294326241134752
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Design improvements",
          "src": "/images/3e7e421f.png",
          "width": 2256,
          "height": 1460,
          "ratio": 0.6471631205673759
        }
      ],
      [
        "img",
        null,
        {
          "caption": "Spec sheets painstakingly created before Zeplin was a thing",
          "alt": "Spec sheets",
          "src": "/images/1b0ffeff.png",
          "width": 2256,
          "height": 1772,
          "ratio": 0.7854609929078015
        }
      ],
      [
        "h2",
        "Marketing & the Beta"
      ],
      [
        "p",
        "Once we had the main functionality working, we went into beta. I shot some photos of the designs on my phone so people could get an idea of what the app would do, and what it was intended for. Then I built a simple website to capture emails for beta testing, and also get a sense of interest surrounding the app."
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Rizon photography",
          "src": "/images/7c3ca258.png",
          "width": 2256,
          "height": 2292,
          "ratio": 1.0159574468085106
        }
      ],
      [
        "img",
        null,
        {
          "caption": "Marketing site after launch",
          "alt": "Rizon website",
          "src": "/images/d8aba3f9.png",
          "width": 2256,
          "height": 2144,
          "ratio": 0.950354609929078
        }
      ],
      [
        "p",
        "We posted the link to photography websites & forums, and a few design sites too. In the first week of the website being live, we had a little over 700 people signed up for the beta. We split the 700 into smaller buckets so we could get more focused feedback. Most of the feedback was fluffy, but it definitely highlighted some common themes. We also got a lot of feature requests for things we'd never thought about."
      ],
      [
        "p",
        "Due to it being a project we could only work on during evenings and weekends, most of the requests had to wait. We had a Trello board full of feature requests which helped us prioritise what to ship first, and kept us focused on getting it out to the world."
      ],
      [
        "p",
        "The features we prioritised for first release were a couple of onboarding screens, reminders, and saved locations. We wanted users to be able to use Rizon no matter where they were in the world, so saved/offline locations were really important to us."
      ],
      [
        "h2",
        "Going Live"
      ],
      [
        "p",
        [
          "Then came the mammoth task of getting screenshots and preparing App Store assets. Luckily we could automate most of this with a sketch ",
          [
            "a",
            "plugin",
            {
              "title": null,
              "href": "https://github.com/preciousforever/sketch-data-populator"
            }
          ],
          " and some open source tools. We used ",
          [
            "a",
            "Fastlane Snapshot",
            {
              "title": null,
              "href": "https://github.com/fastlane/fastlane/tree/master/snapshot"
            }
          ],
          " to generate screenshots at different device sizes. I then generated some JSON for the Sketch plugin to use, and made a large Sketch file with placeholders for the JSON replacement. This made generating screenshots for new versions take around 15 minutes altogether, a real time saver when you're trying to release fast!"
        ]
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Asset prep for the App Store",
          "src": "/images/43a7e335.png",
          "width": 2256,
          "height": 1268,
          "ratio": 0.5620567375886525
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Asset prep for the App Store",
          "src": "/images/68d3df48.png",
          "width": 2256,
          "height": 980,
          "ratio": 0.43439716312056736
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Asset prep for the App Store",
          "src": "/images/f11292df.png",
          "width": 2256,
          "height": 1460,
          "ratio": 0.6471631205673759
        }
      ],
      [
        "img",
        null,
        {
          "caption": "Some small campaign images for social",
          "alt": "Some campaigns for social",
          "src": "/images/7cd3d428.png",
          "width": 2256,
          "height": 988,
          "ratio": 0.4379432624113475
        }
      ],
      [
        "p",
        "We went live! Before that though, we got approached to launch Rizon on Product Hunt which would help us get a bit of extra visibility. I'm glad we did as we got featured on the front page, and held the second spot for the entire day!"
      ],
      [
        "p",
        "About a fortnight after being live, Apple then asked us for some promotional artwork. I got rather excited as I assumed this meant we were in line to be featured somewhere on the App Store. I submitted the artwork and spent the next week furiously refreshing the App Store. Nothing came of it until around a month later when Rizon was featured in the Photo and Video category. Our downloads boomed a little, but nothing major. We also got featured a few times on the main home screen of the App Store which saw much larger spikes."
      ],
      [
        "p",
        "Rizon has been featured in the Photo and Video category pretty consistently since that first feature, and in the first 2 years on the platform, it's been downloaded more than 10,000 times which I never would have imagined!"
      ],
      [
        "img",
        null,
        {
          "caption": "Featured placements on the App Store",
          "alt": "Featured placements on the App Store",
          "src": "/images/74350a19.png",
          "width": 2256,
          "height": 1442,
          "ratio": 0.6391843971631206
        }
      ],
      [
        "h2",
        "Future plans"
      ],
      [
        "p",
        "We've paused work on Rizon as we both have little free time now, but that hasn't stopped me updating designs every now and then. Hopefully we'll get to build all the things on our Trello board some day!"
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Future plans for Rizon",
          "src": "/images/0cd2e49e.png",
          "width": 2256,
          "height": 2760,
          "ratio": 1.2234042553191489
        }
      ],
      [
        "h2",
        "A great learning experience"
      ],
      [
        "p",
        "I've learnt a lot about what it takes to launch a product. I never realised how much work goes into managing a beta, marketing, and even getting things ready for the App Store. I also learnt a little Objective-C! Overall, I've loved working on Rizon despite it initially being a small side project."
      ]
    ]
  },
  {
    "slug": "sandbox",
    "title": "Sandbox",
    "date": "2015—2017",
    "byline": "Learning by making products for myself",
    "roles": [
      "Product",
      "Interface",
      "Engineering"
    ],
    "intro": "I like to make small products for myself. Usually they're just for learning, so they've typically been focused on specific problems I was having at the time.",
    "cover": {
      "src": "/images/f1399218.png",
      "width": 2256,
      "height": 1268,
      "ratio": 0.5620567375886525
    },
    "content": [
      [
        "h2",
        "Habits"
      ],
      [
        "p",
        "I wanted to start forming better habits, but most habit trackers are either crazy complicated, or far too limiting in what you can track. I figured I mostly had two types of goals; amount based, and time based. I made this little app around those two types. You either increment a counter, or start/stop a timer."
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Habits app",
          "src": "/images/3442abbc.png",
          "width": 2256,
          "height": 1248,
          "ratio": 0.5531914893617021
        }
      ],
      [
        "img",
        null,
        {
          "caption": "The whole app and “add new” flow",
          "alt": "Habits app flows",
          "src": "/images/1fb3f151.png",
          "width": 2256,
          "height": 2112,
          "ratio": 0.9361702127659575
        }
      ],
      [
        "img",
        null,
        {
          "caption": "Alternate versions",
          "alt": "Habits app concepts",
          "src": "/images/1fb3f151.png",
          "width": 2256,
          "height": 2112,
          "ratio": 0.9361702127659575
        }
      ],
      [
        "p",
        "Having daily and weekly goals also gave me flexibility when ramping up to a new habit, instead of setting ridiculous goals right off the bat. I also liked the idea of keeping a tab on streaks to reinforce positive behaviour, but it was hard to do without making myself feel bad about missing a day."
      ],
      [
        "h2",
        "Spot list"
      ],
      [
        "p",
        [
          "When I travel, I usually have a huge list of things I want to see. I wanted a nice way of keeping track of all the places I planned on visiting, and what I actually got round to doing. I built a very basic version on the plane to New York using Underscore templates. When I got home, I improved the design, but never got round to building the newer version. I also took a lot of inspiration from ",
          [
            "a",
            "Rizon",
            {
              "title": null,
              "href": "/rizon"
            }
          ],
          " in terms of colour palette and overall style."
        ]
      ],
      [
        "img",
        null,
        {
          "caption": "The version that I made on the plane and used for my trip",
          "alt": "Spot list that was built on the plane",
          "src": "/images/672a2211.png",
          "width": 2256,
          "height": 1248,
          "ratio": 0.5531914893617021
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "First redesign of the spot list app",
          "src": "/images/573b706d.png",
          "width": 2256,
          "height": 1112,
          "ratio": 0.4929078014184397
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Second redesign of the spot list app",
          "src": "/images/e65c141e.png",
          "width": 2256,
          "height": 962,
          "ratio": 0.42641843971631205
        }
      ],
      [
        "img",
        null,
        {
          "caption": "More refined versions of the app design",
          "alt": "Refresh of the spot list app",
          "src": "/images/e65c141e.png",
          "width": 2256,
          "height": 962,
          "ratio": 0.42641843971631205
        }
      ],
      [
        "h2",
        "Note keeper"
      ],
      [
        "p",
        "Most note apps just drop you in to your list of notes, but I found myself constantly adding new ones instead of viewing old ones. I made this simple app to add new notes quickly. You're always dropped into the new note screen instead. I also wanted a way to tag notes with just hashtags for easier organisation."
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Notekeeper app - new note",
          "src": "/images/9329f4f0.png",
          "width": 2256,
          "height": 1248,
          "ratio": 0.5531914893617021
        }
      ],
      [
        "img",
        null,
        {
          "caption": null,
          "alt": "Notekeeper app - all notes and filters",
          "src": "/images/21fd6aa6.png",
          "width": 2256,
          "height": 1108,
          "ratio": 0.49113475177304966
        }
      ]
    ]
  }
]